[
  {
    "id": 1,
    "title": "Introduction to Data Science Tools",
    "posts": [
      {
        "topic_title": "Introduction to Data Science Tools",
        "content": "Welcome to the Tools in Data Science course! This course covers essential tools and technologies used in data science including Python, Jupyter notebooks, pandas, numpy, and more. We'll start with basic concepts and gradually move to advanced topics.",
        "topic_id": 1
      },
      {
        "topic_title": "Introduction to Data Science Tools",
        "content": "Make sure you have Python 3.8+ installed on your system. You can download it from python.org or use Anaconda distribution which comes with many useful packages pre-installed.",
        "topic_id": 1
      }
    ]
  },
  {
    "id": 2,
    "title": "Python Basics for Data Science",
    "posts": [
      {
        "topic_title": "Python Basics for Data Science",
        "content": "Python is the most popular programming language for data science. Key concepts include variables, data types, control structures, functions, and object-oriented programming. We'll focus on practical examples relevant to data analysis.",
        "topic_id": 2
      }
    ]
  },
  {
    "id": 3,
    "title": "Working with Jupyter Notebooks",
    "posts": [
      {
        "topic_title": "Working with Jupyter Notebooks",
        "content": "Jupyter Notebooks provide an interactive environment for data analysis. You can combine code, text, and visualizations in a single document. This makes it perfect for exploratory data analysis and sharing results.",
        "topic_id": 3
      }
    ]
  },
  {
    "id": 4,
    "title": "Data Manipulation with Pandas",
    "posts": [
      {
        "topic_title": "Data Manipulation with Pandas",
        "content": "Pandas is a powerful library for data manipulation and analysis. It provides data structures like DataFrames and Series that make it easy to work with structured data. Key operations include filtering, grouping, merging, and aggregating data.",
        "topic_id": 4
      }
    ]
  },
  {
    "id": 5,
    "title": "Token Cost Calculation",
    "posts": [
      {
        "topic_title": "Token Cost Calculation",
        "content": "To calculate token costs for text, you need to understand how language models tokenize text. Different languages have different tokenization patterns. For Japanese text, characters are typically tokenized differently than English text.",
        "topic_id": 5
      }
    ]
  }
]